MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334K8TI/mcu.h
/*  Bit definition for INTC_FPUIER register  */
#define INTC_FPUIER_IOCIEN_POS                         (0U)
#define INTC_FPUIER_IOCIEN                             (0x00000001UL)
#define INTC_FPUIER_DZCIEN_POS                         (1U)
#define INTC_FPUIER_DZCIEN                             (0x00000002UL)
#define INTC_FPUIER_OFCIEN_POS                         (2U)
#define INTC_FPUIER_OFCIEN                             (0x00000004UL)
#define INTC_FPUIER_UFCIEN_POS                         (3U)
#define INTC_FPUIER_UFCIEN                             (0x00000008UL)
#define INTC_FPUIER_IXCIEN_POS                         (4U)
#define INTC_FPUIER_IXCIEN                             (0x00000010UL)
#define INTC_FPUIER_IDCIEN_POS                         (5U)
#define INTC_FPUIER_IDCIEN                             (0x00000020UL)

/*******************************************************************************
                Bit definition for Peripheral MCAN
*******************************************************************************/
/*  Bit definition for MCAN_ENDN register  */
#define MCAN_ENDN                                      (0xFFFFFFFFUL)

/*  Bit definition for MCAN_DBTP register  */
#define MCAN_DBTP_DSJW_POS                             (0U)
#define MCAN_DBTP_DSJW                                 (0x0000000FUL)
#define MCAN_DBTP_DTSEG2_POS                           (4U)
#define MCAN_DBTP_DTSEG2                               (0x000000F0UL)
#define MCAN_DBTP_DTSEG1_POS                           (8U)
#define MCAN_DBTP_DTSEG1                               (0x00001F00UL)
#define MCAN_DBTP_DBRP_POS                             (16U)
#define MCAN_DBTP_DBRP                                 (0x001F0000UL)
#define MCAN_DBTP_TDC_POS                              (23U)
#define MCAN_DBTP_TDC                                  (0x00800000UL)

/*  Bit definition for MCAN_TEST register  */
#define MCAN_TEST_LBCK_POS                             (4U)
#define MCAN_TEST_LBCK                                 (0x00000010UL)
#define MCAN_TEST_TX_POS                               (5U)
#define MCAN_TEST_TX                                   (0x00000060UL)
#define MCAN_TEST_TX_0                                 (0x00000020UL)
#define MCAN_TEST_TX_1                                 (0x00000040UL)
#define MCAN_TEST_RX_POS                               (7U)
#define MCAN_TEST_RX                                   (0x00000080UL)
#define MCAN_TEST_TXBNP_POS                            (8U)
#define MCAN_TEST_TXBNP                                (0x00001F00UL)
#define MCAN_TEST_PVAL_POS                             (13U)
#define MCAN_TEST_PVAL                                 (0x00002000UL)
#define MCAN_TEST_TXBNS_POS                            (16U)
#define MCAN_TEST_TXBNS                                (0x001F0000UL)
#define MCAN_TEST_SVAL_POS                             (21U)
#define MCAN_TEST_SVAL                                 (0x00200000UL)

/*  Bit definition for MCAN_RWD register  */
#define MCAN_RWD_WDC_POS                               (0U)
#define MCAN_RWD_WDC                                   (0x000000FFUL)
#define MCAN_RWD_WDV_POS                               (8U)
#define MCAN_RWD_WDV                                   (0x0000FF00UL)

/*  Bit definition for MCAN_CCCR register  */
#define MCAN_CCCR_INIT_POS                             (0U)
#define MCAN_CCCR_INIT                                 (0x00000001UL)
#define MCAN_CCCR_CCE_POS                              (1U)
#define MCAN_CCCR_CCE                                  (0x00000002UL)
#define MCAN_CCCR_ASM_POS                              (2U)
#define MCAN_CCCR_ASM                                  (0x00000004UL)
#define MCAN_CCCR_CSA_POS                              (3U)
#define MCAN_CCCR_CSA                                  (0x00000008UL)
#define MCAN_CCCR_CSR_POS                              (4U)
#define MCAN_CCCR_CSR                                  (0x00000010UL)
#define MCAN_CCCR_MON_POS                              (5U)
#define MCAN_CCCR_MON                                  (0x00000020UL)
#define MCAN_CCCR_DAR_POS                              (6U)
#define MCAN_CCCR_DAR                                  (0x00000040UL)
#define MCAN_CCCR_TEST_POS                             (7U)
#define MCAN_CCCR_TEST                                 (0x00000080UL)
#define MCAN_CCCR_FDOE_POS                             (8U)
#define MCAN_CCCR_FDOE                                 (0x00000100UL)
#define MCAN_CCCR_BRSE_POS                             (9U)
#define MCAN_CCCR_BRSE                                 (0x00000200UL)
#define MCAN_CCCR_UTSU_POS                             (10U)
#define MCAN_CCCR_UTSU                                 (0x00000400UL)
#define MCAN_CCCR_WMM_POS                              (11U)
#define MCAN_CCCR_WMM                                  (0x00000800UL)
#define MCAN_CCCR_PXHD_POS                             (12U)
#define MCAN_CCCR_PXHD                                 (0x00001000UL)
#define MCAN_CCCR_EFBI_POS                             (13U)
#define MCAN_CCCR_EFBI                                 (0x00002000UL)
#define MCAN_CCCR_TXP_POS                              (14U)
#define MCAN_CCCR_TXP                                  (0x00004000UL)
#define MCAN_CCCR_NISO_POS                             (15U)
#define MCAN_CCCR_NISO                                 (0x00008000UL)

/*  Bit definition for MCAN_NBTP register  */
#define MCAN_NBTP_NTSEG2_POS                           (0U)
#define MCAN_NBTP_NTSEG2                               (0x0000007FUL)
#define MCAN_NBTP_NTSEG1_POS                           (8U)
#define MCAN_NBTP_NTSEG1                               (0x0000FF00UL)
#define MCAN_NBTP_NBRP_POS                             (16U)
#define MCAN_NBTP_NBRP                                 (0x01FF0000UL)
#define MCAN_NBTP_NSJW_POS                             (25U)
#define MCAN_NBTP_NSJW                                 (0xFE000000UL)

/*  Bit definition for MCAN_TSCC register  */
#define MCAN_TSCC_TSS_POS                              (0U)
#define MCAN_TSCC_TSS                                  (0x00000003UL)
#define MCAN_TSCC_TSS_0                                (0x00000001UL)
#define MCAN_TSCC_TSS_1                                (0x00000002UL)
#define MCAN_TSCC_TCP_POS                              (16U)
#define MCAN_TSCC_TCP                                  (0x000F0000UL)

/*  Bit definition for MCAN_TSCV register  */
#define MCAN_TSCV_TSC                                  (0x0000FFFFUL)

