MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334K8TI/mcu.h
typedef struct {
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podr_bit_t;

typedef struct {
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poer_bit_t;

typedef struct {
    __O  uint32_t POS00;
    __O  uint32_t POS01;
    __O  uint32_t POS02;
    __O  uint32_t POS03;
    __O  uint32_t POS04;
    __O  uint32_t POS05;
    __O  uint32_t POS06;
    __O  uint32_t POS07;
    __O  uint32_t POS08;
    __O  uint32_t POS09;
    __O  uint32_t POS10;
    __O  uint32_t POS11;
    __O  uint32_t POS12;
    __O  uint32_t POS13;
    __O  uint32_t POS14;
    __O  uint32_t POS15;
} stc_gpio_posr_bit_t;

typedef struct {
    __O  uint32_t POR00;
    __O  uint32_t POR01;
    __O  uint32_t POR02;
    __O  uint32_t POR03;
    __O  uint32_t POR04;
    __O  uint32_t POR05;
    __O  uint32_t POR06;
    __O  uint32_t POR07;
    __O  uint32_t POR08;
    __O  uint32_t POR09;
    __O  uint32_t POR10;
    __O  uint32_t POR11;
    __O  uint32_t POR12;
    __O  uint32_t POR13;
    __O  uint32_t POR14;
    __O  uint32_t POR15;
} stc_gpio_porr_bit_t;

typedef struct {
    __O  uint32_t POT00;
    __O  uint32_t POT01;
    __O  uint32_t POT02;
    __O  uint32_t POT03;
    __O  uint32_t POT04;
    __O  uint32_t POT05;
    __O  uint32_t POT06;
    __O  uint32_t POT07;
    __O  uint32_t POT08;
    __O  uint32_t POT09;
    __O  uint32_t POT10;
    __O  uint32_t POT11;
    __O  uint32_t POT12;
    __O  uint32_t POT13;
    __O  uint32_t POT14;
    __O  uint32_t POT15;
} stc_gpio_potr_bit_t;

typedef struct {
    __IO uint32_t HRSEL0;
    __IO uint32_t HRSEL1;
    __IO uint32_t HRSEL2;
    __IO uint32_t HRSEL3;
    __IO uint32_t HRSEL4;
    __IO uint32_t HRSEL5;
    __IO uint32_t HRSEL6;
    __IO uint32_t HRSEL7;
    __IO uint32_t HRSEL8;
    __IO uint32_t HRSEL9;
    __IO uint32_t HRSEL10;
    __IO uint32_t HRSEL11;
    uint32_t RESERVED0[4];
    __IO uint32_t HREX0;
    __IO uint32_t HREX1;
    __IO uint32_t HREX2;
    __IO uint32_t HREX3;
    __IO uint32_t HREX4;
    __IO uint32_t HREX5;
    __IO uint32_t HREX6;
    __IO uint32_t HREX7;
    __IO uint32_t HREX8;
    __IO uint32_t HREX9;
    __IO uint32_t HREX10;
    __IO uint32_t HREX11;
    uint32_t RESERVED1[4];
} stc_gpio_hrpwm_bit_t;

typedef struct {
    __IO uint32_t WE;
    uint32_t RESERVED0[15];
} stc_gpio_pwpr_bit_t;

typedef struct {
    __IO uint32_t POUT;
    __IO uint32_t POUTE;
    __IO uint32_t NOD;
    uint32_t RESERVED0[3];
    __IO uint32_t PUU;
    __IO uint32_t PUD;
    __I  uint32_t PIN;
    __IO uint32_t INVE;
    __IO uint32_t CINSEL;
    uint32_t RESERVED1[1];
    __IO uint32_t INTE;
    __IO uint32_t PINAE;
    __IO uint32_t LTE;
    __IO uint32_t DDIS;
} stc_gpio_pcr_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t BFE;
    uint32_t RESERVED1[7];
} stc_gpio_pfsr_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __I  uint32_t CAPDIRA;
    uint32_t RESERVED1[9];
} stc_hrpwm_capar_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __I  uint32_t CAPDIRB;
    uint32_t RESERVED1[9];
} stc_hrpwm_capbr_bit_t;

typedef struct {
    __IO uint32_t START;
    uint32_t RESERVED0[1];
    __IO uint32_t MODE;
    uint32_t RESERVED1[5];
    __IO uint32_t OVSTP;
    uint32_t RESERVED2[23];
} stc_hrpwm_gconr_bit_t;

typedef struct {
    __IO uint32_t INTENA;
    __IO uint32_t INTENB;
    __IO uint32_t INTENC;
    __IO uint32_t INTEND;
    __IO uint32_t INTENE;
    __IO uint32_t INTENF;
    __IO uint32_t INTENOVF;
    __IO uint32_t INTENUDF;
    uint32_t RESERVED0[6];
    __IO uint32_t INTENCAPA;
    __IO uint32_t INTENCAPB;
    __IO uint32_t INTENSAU;
    __IO uint32_t INTENSAD;
    __IO uint32_t INTENSBU;
    __IO uint32_t INTENSBD;
    uint32_t RESERVED1[12];
} stc_hrpwm_iconr_bit_t;

typedef struct {
    __IO uint32_t BENAE;
    uint32_t RESERVED0[1];
    __IO uint32_t BTRUAE;
    __IO uint32_t BTRDAE;
    __IO uint32_t BENBF;
    uint32_t RESERVED1[1];
    __IO uint32_t BTRUBF;
    __IO uint32_t BTRDBF;
    __IO uint32_t BENP;
    uint32_t RESERVED2[1];
    __IO uint32_t BTRUP;
    __IO uint32_t BTRDP;
    uint32_t RESERVED3[4];
    __IO uint32_t BENSPA;
    uint32_t RESERVED4[1];
    __IO uint32_t BTRUSPA;
    __IO uint32_t BTRDSPA;
    __IO uint32_t BENSPB;
    uint32_t RESERVED5[1];
    __IO uint32_t BTRUSPB;
    __IO uint32_t BTRDSPB;
    uint32_t RESERVED6[8];
} stc_hrpwm_bconr1_bit_t;

typedef struct {
    __IO uint32_t DTCEN;
    __IO uint32_t SEPA;
    uint32_t RESERVED0[2];
    __IO uint32_t DTBENU;
    __IO uint32_t DTBEND;
    __IO uint32_t DTBTRU;
    __IO uint32_t DTBTRD;
    uint32_t RESERVED1[24];
} stc_hrpwm_dconr_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t OUTENA;
    uint32_t RESERVED1[3];
} stc_hrpwm_pcnar1_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t OUTENB;
    uint32_t RESERVED1[3];
} stc_hrpwm_pcnbr1_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t SPPERIA;
    __IO uint32_t SPPERIB;
    uint32_t RESERVED1[22];
} stc_hrpwm_vperr_bit_t;

typedef struct {
    __IO uint32_t CMAF;
    __IO uint32_t CMBF;
    __IO uint32_t CMCF;
    __IO uint32_t CMDF;
    __IO uint32_t CMEF;
    __IO uint32_t CMFF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
    uint32_t RESERVED0[1];
    __IO uint32_t CMSAUF;
    __IO uint32_t CMSADF;
    __IO uint32_t CMSBUF;
    __IO uint32_t CMSBDF;
    uint32_t RESERVED1[13];
    __IO uint32_t CAPAF;
    __IO uint32_t CAPBF;
    uint32_t RESERVED2[3];
    __I  uint32_t DIRF;
} stc_hrpwm_stflr1_bit_t;

